---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceReference.GetReferenceInformation
source: html/f02de1b9-6f2b-3c93-f7b1-8db6fa2476fb.htm
---
# Autodesk.Revit.DB.ExternalResourceReference.GetReferenceInformation Method

Returns a copy of an object containing previously-stored reference or lookup
 information about the specific resource provided by the server.

## Syntax (C#)
```csharp
public IDictionary<string, string> GetReferenceInformation()
```

## Returns
A copy of a (String, String) map containing previously-stored reference or
 lookup information.